## 데이터 사이언스 스쿨 

>링크 : https://datascienceschool.net/intro.html  
>참고 : https://passwd.tistory.com/entry/Python-Pandas-Series-1


## Serise

```
-> list            -> array              -> serise
series.tolist()    series.to_numpy()     pandas.serise(array)   
arrary.tolist()    numpy.array(list)     pandas.serise(list)  
```

Series methodes
```
.to_numpy  
.to_list  / tolist
.at  
.iat  
.loc
.ilic
.itmes
.round
.mod
.apply
.agg
.groupby
.rolling
.any
.all
.corr
.count
.max
.median
.mean
.mode
.skew
.std
.var
.unique / nunique / is_unique
.isin
.isnull / isna
.fillna
.mask  / where
.head / tail
.sort_values / .sort_index
.stack / .unstack
.squeez
.resample
```

In [263]:
import numpy as np
import pandas as pd

In [264]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [265]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [266]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [267]:
s[0:3]

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [268]:
s['서울':'인천']

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [269]:
s.values[0]     # 명시적 인덱스는 '서울' 이지만, 암묵적 인덱스 0 을 사용해도 된다.

9904312

In [270]:
s['서울']

9904312

In [271]:
s[s.values == 9904312].index

Index(['서울'], dtype='object')

In [272]:
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [273]:
s0.a

0

In [274]:
s0['a']

0

In [275]:
s0.loc['a']

0

In [276]:
s0.reset_index()

  index  0
0     a  0
1     b  1
2     c  2

In [277]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [278]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [279]:
ds = s + s2
ds

대구           NaN
대전           NaN
부산     6841928.0
서울    19535794.0
인천     5522486.0
dtype: float64

## DataFrame

```
-> DataFrame : dp.DataFrame( np.array | list | dict | series)  /  serise.to_frame()
DataFrame -> : df.values  (df.to_arrary()) / df.value.tolist() / df.to_dict()   
```

In [280]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [281]:
# df.서울  (index 는 df.으로 접근할 수 없다., column은 가능)
# df[colum][row] 는 가능 : df[col]가 serise이므로 'serise[index]' 로 인식함.
# df[0] 은 문자열 column 인 경우 사용 불가. (정수형 column 인 경우는 OK)  -> 문자 column인 경우  iloc[0:1] 사용

# df.colum, df[column] vs df[row : ]
# loc[row] vs loc[ : , col]
# iloc[row_int] vs iloc[ : , col_int]

print(df['서울':'서울'])
# print(df['2010':'2000']) column은 왜 안되는 거야?
print(df[0:1])
print(df.iloc[0:1])
# 이렇게 사용하지 말고, 

print(df.loc['서울'])

# 이렇게 사용하자

df[df.index == '서울']

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
지역                   수도권
2015             9904312
2010             9631482
2005             9762546
2000             9853972
2010-2015 증가율     0.0283
Name: 서울, dtype: object

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [282]:
df.loc['서울'].squeeze()

지역                   수도권
2015             9904312
2010             9631482
2005             9762546
2000             9853972
2010-2015 증가율     0.0283
Name: 서울, dtype: object

In [283]:
# df['서울']    # 은 '서울'은 index 이다, col 을 기대해서 오류가 난다

print(df['2010'])

df['2010']['서울']    # 이 정상적인 이유는 'df['2010'] 이 index 가 있는 Serise 이고, 이 series[index] 을 한 경과 이다.'

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

9631482

In [284]:
df.지역

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [285]:
# (1) 모든 도시의 2010 인구수를 시리즈로 나타낸다.

df['2010']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [286]:
# (2) 모든 도시의 2015와 2005 인구수를 데이터 프레임으로 나타낸다.

df[['2015','2005']]

       2015     2005
서울  9904312  9762546
부산  3448737  3512547
인천  2890451  2517680
대구  2466052  2456016

In [287]:
# (3) 모든 도시의 각 해 평균 인구수를 새로운 열로 추가한다.
del df['지역']

In [288]:
print(df.mean(axis='columns'))
df['mean']= df.mean(axis='columns')    #계산되는 값은 columns 이다. 
df

서울    7.830462e+06
부산    2.801982e+06
인천    2.101301e+06
대구    1.965566e+06
dtype: float64

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [289]:
# (4) 인천의 2010년 인구수를 2632030 으로 수정하고 평균 점수도 다시 계산한다.

print(df['2010'])
print(type(df['2010']))
print((df['2010']['인천']))     # serise['인천']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64
<class 'pandas.core.series.Series'>
2632035

In [290]:
# (5) 대구의 인구수를 데이터프레임으로 나타낸다.
# (6) 서울의 인구수를 시리즈로 나타낸다.

## loc, iloc
```
loc  : label, 명시적, 몇번 (at)
iloc : position, 암묵적, 몇번째 (iat)
```

In [291]:
# col 2010 값이 3백만 보다 큰 row 들 의 2015 col 값

df.loc[df['2010'] > 3_000_000, '2015' ]     

# df.loc[ index , column ] 형태 /  (df['2010'] > 3_000_000) 는 조건에 true 인 index 를 리턴

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [292]:
print(df.loc[:,'2010']>3_000_000)
# (df['2010'] > 3_000_000) 와 같은 조건에 true인 index 를 리턴

df[df.loc[:,'2010']>3_000_000].loc[:,'2015']

# df[index].loc[:,column] 형태

서울     True
부산     True
인천    False
대구    False
Name: 2010, dtype: bool

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [293]:
df.loc['서울':'부산','2015']

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [294]:
df[0:2].loc[:,'2015']

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [295]:
filt = df['2015'] < 3000000 
filt2 = df['2000'] >2460000

print(filt)
print(filt2)
print(filt&filt2)
# df[df.loc[:,'2010'] < 2500000]

print(df[0:4][df[0:4].loc[:,'2010'] < 2500000])

df[filt&filt2][df[filt&filt2].loc[:,'2010'] < 2500000]

# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

서울    False
부산    False
인천     True
대구     True
Name: 2015, dtype: bool
서울    True
부산    True
인천    True
대구    True
Name: 2000, dtype: bool
서울    False
부산    False
인천     True
대구     True
dtype: bool
       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [302]:
df[filt&filt2].loc[df[filt&filt2]['2010']<2500000]

       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [303]:
df[filt&filt2].query(" `2010` < 2500000")

       2015     2010     2005     2000  2010-2015 증가율          mean
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

indexing 결론

series.index_lable / siries['index_label'] df 와 혼동되니 사용하지 말자 / series.loc['index_lable']  

**df['column_label']**  / df.column_label  
**df.loc['index_label']**  /df.loc[index_int]

df.iloc[index_int]  / df[index_int]


slicing 결론  

```df.loc['index_label_start':'stop', 'coulmn_lable_start':'stop']```

contidion (boolean) 결론

전제 dataframe 의 index 와 조건 dataframe 의 index  을 맞추어야 한다.  
iloc은 사용할수 없다. (추가/삭제로 몇번째는 계속 변하니까)  
```df.loc[조건,columns]```

## Methods
### count() / values_count()

In [216]:
# 각 column 별 row 값 갯수
df.count()

2015             4
2010             4
2005             4
2000             4
2010-2015 증가율    4
mean             4
dtype: int64

In [217]:
df.value_counts()

# 이건 무순 말이지?

2015     2010     2005     2000     2010-2015 증가율  mean
2466052  2431774  2456016  2473990  0.0141         1.965566e+06    1
2890451  2632035  2517680  2466338  0.0982         2.101301e+06    1
3448737  3393191  3512547  3655437  0.0163         2.801982e+06    1
9904312  9631482  9762546  9853972  0.0283         7.830462e+06    1
dtype: int64

In [218]:
df.loc[:,'2015'].count()

4

In [219]:

df.loc[:,'2015'].value_counts()

9904312    1
3448737    1
2890451    1
2466052    1
Name: 2015, dtype: int64

### drop() / T / astype()

In [220]:
# del df['2010-2015 증가율']   ## df 에 바로 적용되므로  위 코드에서 df 을 재 계산하면 값이 달라진다.

print(df)

# df2 = df.drop('2010-2015 증가율',axis='columns')   # column 삭제, df 원본에 영향을 주지 않고, 새로은 df2 생성

print(df[df['2015']<9000000])                            # 삭제 대상 row
df2 = df.drop(df.loc[df.loc[:,'2015']<9000000,].index)   # row 삭제 (조건 부분에 row 가 변함)

print(df2)
print(df)

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [221]:
df3 = df2.T
print(df3.dtypes)
df3 = df3.astype(int)
print(df3.dtypes)
df3

서울    float64
dtype: object
서울    int64
dtype: object

                    서울
2015           9904312
2010           9631482
2005           9762546
2000           9853972
2010-2015 증가율        0
mean           7830462

### sum()  / mean()

In [222]:
df3.mean(axis=1)

2015             9904312.0
2010             9631482.0
2005             9762546.0
2000             9853972.0
2010-2015 증가율          0.0
mean             7830462.0
dtype: float64

In [223]:
print(type(df3.mean(axis=1)))

print(df3.mean(axis=1)[['2005','2000']])
print(df3.mean(axis=1)[[2,3]])
print(df3.mean(axis=1)[2:4])
df3.mean(axis=1).loc[['2005','2000']]

<class 'pandas.core.series.Series'>
2005    9762546.0
2000    9853972.0
dtype: float64
2005    9762546.0
2000    9853972.0
dtype: float64
2005    9762546.0
2000    9853972.0
dtype: float64

2005    9762546.0
2000    9853972.0
dtype: float64

### apply() / lambda()

https://aplab.tistory.com/entry/pandas-apply

In [224]:
df

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [225]:
df4 = df.copy()
df4.apply(lambda x : x.max()- x.min() ,axis='columns')

# df 에 적용되었으므로 x 에 각 행(series)이 들어가 column을 계산한다.

서울    9.904312e+06
부산    3.655437e+06
인천    2.890451e+06
대구    2.473990e+06
dtype: float64

In [226]:
def funX (dfX):
    return dfX.max()-dfX.min()        # 각 행이 전달되고, 해당 행의 series.max - series.min 이 리턴된다.

df4.apply(funX, axis=1)

서울    9.904312e+06
부산    3.655437e+06
인천    2.890451e+06
대구    2.473990e+06
dtype: float64

In [227]:
df3['서울'].apply(lambda x : x *10)

# df.Series 에 적용되었으므로 x에 Series 의 개별값이 들어 간다. (df.map() 같은???)

2015             99043120
2010             96314820
2005             97625460
2000             98539720
2010-2015 증가율           0
mean             78304620
Name: 서울, dtype: int64

###  notnull(), notna() /  isnull(), isna()

In [228]:
print(df3.apply(pd.value_counts))
print(type(df3.apply(pd.value_counts)))

df3.apply(pd.value_counts).notnull()

         서울
9904312   1
9631482   1
9762546   1
9853972   1
0         1
7830462   1
<class 'pandas.core.frame.DataFrame'>

           서울
9904312  True
9631482  True
9762546  True
9853972  True
0        True
7830462  True

In [229]:
df3.apply(pd.value_counts).isnull()

            서울
9904312  False
9631482  False
9762546  False
9853972  False
0        False
7830462  False

### fillna() / dropna()

In [230]:
qdata = df3.apply(pd.value_counts)['서울'].fillna(0).astype(int)
qdata

9904312    1
9631482    1
9762546    1
9853972    1
0          1
7830462    1
Name: 서울, dtype: int64

In [231]:
qcut =pd.cut(qdata,bins=[-100,0,100],labels=['음수', '양수'])
qcut

9904312    양수
9631482    양수
9762546    양수
9853972    양수
0          양수
7830462    양수
Name: 서울, dtype: category
Categories (2, object): ['음수' < '양수']

In [232]:
qcat = pd.qcut(qdata.index, 4, labels=["Q1", "Q2", "Q3", "Q4"])
qcat

['Q4', 'Q2', 'Q3', 'Q4', 'Q1', 'Q1']
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

### replace() / query() / isin()

## multi-index
### groupby

In [233]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df4

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [234]:
df5 = pd.DataFrame(np.round(np.random.randn(5,4),2),
                   columns=list('ABbC'),
                   index=list('abcde'))
df5

      A     B     b     C
a -2.55  0.65  0.86 -0.74
b  2.27 -1.45  0.05 -0.19
c  1.53  1.47  0.15  0.38
d -0.89 -1.98 -0.35  0.16
e  1.23  1.20 -0.39 -0.30

In [235]:
df5.columns.str.lower().is_unique

# colume 이 각각 소문자와 대문자로 표시된 동일한 colume 이 존재

False

In [236]:
df5.columns = df5.columns.str.upper()     # columns 을 모두 upper로 reset
df5.groupby(level=0,axis=1).mean()     # 동일한 columns 을 구룹화해서 평균값 넣기

      A      B     C
a -2.55  0.755 -0.74
b  2.27 -0.700 -0.19
c  1.53  0.810  0.38
d -0.89 -1.165  0.16
e  1.23  0.405 -0.30

In [237]:
df5

      A     B     B     C
a -2.55  0.65  0.86 -0.74
b  2.27 -1.45  0.05 -0.19
c  1.53  1.47  0.15  0.38
d -0.89 -1.98 -0.35  0.16
e  1.23  1.20 -0.39 -0.30

### set_index() / reset_index()

groupby 로 slicing 한 df을 reset_index() 으로 해제 한다.

## groupby object

### groupby metho
```
size, count: 그룹 데이터의 갯수
mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대
sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수
first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터
agg, aggregate : 또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.
describe : 하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.
apply : describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다.
transform : 그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.
```

### pivot table

In [238]:
pdata = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
pdf= pd.DataFrame(pdata, columns=columns)
pdf

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [239]:
pdf_drop = pdf.drop([0,2,5])
pdf_drop

# index 값은 다시 리셋되지 않는다. 따라서.. reset_index 
# pdf_drop[2] 는 오류가 발생한다. -> column 으로 판단 하기 때문
# pdf_drop.loc[2] 도 동일하게 오류 발생 ->  명시적 인덱스 2을 찾음

   도시    연도       인구   지역
1  서울  2010  9631482  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [240]:
# iloc 을 사용해야 한다. 
pdf_drop.iloc[2]

도시         부산
연도       2010
인구    3393191
지역        경상권
Name: 4, dtype: object

In [241]:
# 이상황에서 2번째 row 을 출력하기 위해서는 ????
print(pdf_drop.index[1])                     # label 인덱스의 2번째 값 3 을 출력
print(pdf_drop.iloc[pdf_drop.index[1]])      # iloc 암묵적 (loaction) 인덱스를 사용하므로 4번째 값이 출력됨
print(pdf_drop.loc[pdf_drop.index[1]])       # loc 는 명시적 (label) 인덱스를 사용하므로 3 이라는 인덱스를 갖고 있는 2번째 값을 출력함.

3
도시         인천
연도       2015
인구    2890451
지역        수도권
Name: 6, dtype: object
도시         부산
연도       2015
인구    3448737
지역        경상권
Name: 3, dtype: object

In [242]:
pdf.pivot('도시','연도','인구').fillna(0).astype(int)

연도     2005     2010     2015
도시
부산  3512547  3393191  3448737
서울  9762546  9631482  9904312
인천        0   263203  2890451

In [243]:
pdf.set_index(["도시", "연도"])[["인구"]].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [244]:
pdf2 = pdf.set_index(["도시", "연도"])[["인구"]]
pdf2.reset_index

<bound method DataFrame.reset_index of               인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010   263203>

## merge() / join() / concat()

In [245]:
df6 = df.copy()
df6

       2015     2010     2005     2000  2010-2015 증가율          mean
서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [246]:
df6.reset_index(inplace=True)
df6

  index     2015     2010     2005     2000  2010-2015 증가율          mean
0    서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
1    부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
2    인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
3    대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [247]:
df6.columns

Index(['index', '2015', '2010', '2005', '2000', '2010-2015 증가율', 'mean'], dtype='object')

In [248]:
df6.columns = ['도시', '2015', '2010', '2005', '2000', '2010-2015 증가율', 'mean']
df6

   도시     2015     2010     2005     2000  2010-2015 증가율          mean
0  서울  9904312  9631482  9762546  9853972         0.0283  7.830462e+06
1  부산  3448737  3393191  3512547  3655437         0.0163  2.801982e+06
2  인천  2890451  2632035  2517680  2466338         0.0982  2.101301e+06
3  대구  2466052  2431774  2456016  2473990         0.0141  1.965566e+06

In [249]:
df6.index

# RangeIndex(start=0, stop=4, step=1)

RangeIndex(start=0, stop=4, step=1)

In [250]:
df6.iloc[0,:]

도시                          서울
2015                   9904312
2010                   9631482
2005                   9762546
2000                   9853972
2010-2015 증가율           0.0283
mean             7830462.40566
Name: 0, dtype: object

In [252]:
# row 추가  df.loc[index,:] = values   
# ---> index 가 position 에서 정수 명목 (label) 인텍스로 변경된다. 

df6.loc[4] = np.nan
df6

,도시,2015,2010,2005,2000,2010-2015 증가율,mean
0,서울,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06
1,부산,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06
2,인천,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06
3,대구,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [253]:
df6.index

# 정수형 lable index 로 변경되었다. 
# Int64Index([0, 1, 2, 3, 4], dtype='int64')
# 이후 df.loc[int,:] 으로 접근가능

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [256]:
df6.iloc[0,:]

도시                          서울
2015                 9904312.0
2010                 9631482.0
2005                 9762546.0
2000                 9853972.0
2010-2015 증가율           0.0283
mean             7830462.40566
Name: 0, dtype: object

In [257]:
# column  추가 :  df['label'] = values

df6.loc[:,'2023'] = 2022
df6

,도시,2015,2010,2005,2000,2010-2015 증가율,mean,2023
0,서울,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06,2022
1,부산,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06,2022
2,인천,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06,2022
3,대구,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06,2022
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022

In [258]:
df6.loc[5,:] = 5
df6

,도시,2015,2010,2005,2000,2010-2015 증가율,mean,2023
0,서울,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06,2022.0
1,부산,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06,2022.0
2,인천,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06,2022.0
3,대구,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06,2022.0
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022.0
5,5,5.0,5.0,5.0,5.0,5.0000,5.000000e+00,5.0

In [259]:
pd.concat([df6,df],axis=1,ignore_index=True)

# axis = 1 이므로 column 값이 리셋된다.

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,서울,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06,2022.0,NaN,NaN,NaN,NaN,NaN,NaN
1,부산,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06,2022.0,NaN,NaN,NaN,NaN,NaN,NaN
2,인천,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06,2022.0,NaN,NaN,NaN,NaN,NaN,NaN
3,대구,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06,2022.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022.0,NaN,NaN,NaN,NaN,NaN,NaN
5,5,5.0,5.0,5.0,5.0,5.0000,5.000000e+00,5.0,NaN,NaN,NaN,NaN,NaN,NaN
대구,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06
부산,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06
서울,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06
인천,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06

In [262]:
pd.concat([df6,df],axis=0,ignore_index=True)

# index 값이 리셋된다.

,도시,2015,2010,2005,2000,2010-2015 증가율,mean,2023
0,서울,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06,2022.0
1,부산,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06,2022.0
2,인천,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06,2022.0
3,대구,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06,2022.0
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022.0
5,5,5.0,5.0,5.0,5.0,5.0000,5.000000e+00,5.0
6,NaN,9904312.0,9631482.0,9762546.0,9853972.0,0.0283,7.830462e+06,NaN
7,NaN,3448737.0,3393191.0,3512547.0,3655437.0,0.0163,2.801982e+06,NaN
8,NaN,2890451.0,2632035.0,2517680.0,2466338.0,0.0982,2.101301e+06,NaN
9,NaN,2466052.0,2431774.0,2456016.0,2473990.0,0.0141,1.965566e+06,NaN